kata/rails/refactor-kata/rails/app/controllers/tickets_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."username" = 'villianUser' LIMIT 1
INSERT INTO "tickets" ("assigned_id", "created_at", "description", "submitter_id", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["assigned_id", 2], ["created_at", "2015-01-04 05:00:23.988189"], ["description", "description"], ["submitter_id", 1], ["title", "title"], ["updated_at", "2015-01-04 05:00:23.988189"]]
SELECT  "users".* FROM "users"  WHERE (current_ticket_id is NULL and role IN (1,2))  ORDER BY "users"."id" ASC LIMIT 1
UPDATE "users" SET "current_ticket_id" = ?, "updated_at" = ? WHERE "users"."id" = 2  [["current_ticket_id", 1], ["updated_at", "2015-01-04 05:00:23.990030"]]
---
  def create
    ticket = Ticket.new
    ticket.submitter = User.find_by(username: params[:user])
    ticket.title = params[:title]
    ticket.description = params[:description]
    roles = []
    ticket.assigned = User.where("current_ticket_id is ? and role IN (?)",
               nil, ticket.submitter.supervillian? ? roles << User.roles[:senior_support] :
               [User.roles[:junior_support], User.roles[:senior_support]] ).first

    ticket.open!
    ticket.save!

SELECT  "tickets".* FROM "tickets"  WHERE "tickets"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "tickets" SET "assigned_id" = ?, "updated_at" = ? WHERE "tickets"."id" = 2  [["assigned_id", 2], ["updated_at", "2015-01-04 05:00:24.075243"]]
SELECT  "tickets".* FROM "tickets" INNER JOIN "users" ON "users"."id" = "tickets"."submitter_id" WHERE (assigned_id is NULL and users.role in (3) )  ORDER BY "tickets"."id" ASC LIMIT 1
UPDATE "users" SET "current_ticket_id" = ?, "updated_at" = ? WHERE "users"."id" = 2  [["current_ticket_id", nil], ["updated_at", "2015-01-04 05:00:24.056222"]]
---
  def update
    ticket = Ticket.find(params[:id])
    ticket.status = params[:status]
    ticket.save!

    if ticket.closed?
      assigned_user = ticket.assigned
      roles = []
      next_ticket = Ticket.joins(:submitter).
        where("assigned_id is ? and users.role in (?) ",
              nil,  assigned_user.junior_support? ?
              roles << User.roles[:villian] :
              [User.roles[:villian], User.roles[:supervillian]]).first
        assigned_user.current_ticket = next_ticket
      assigned_user.save!