kata/rails/2/controller-oriented-design/app/controllers/tickets_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."username" = 'villianUser' LIMIT 1
INSERT INTO "tickets" ("assigned_id", "created_at", "description", "submitter_id", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["assigned_id", 2], ["created_at", "2015-01-04 04:58:27.787078"], ["description", "description"], ["submitter_id", 1], ["title", "title"], ["updated_at", "2015-01-04 04:58:27.787078"]]
UPDATE "users" SET "current_ticket_id" = ?, "updated_at" = ? WHERE "users"."id" = 2  [["current_ticket_id", 1], ["updated_at", "2015-01-04 04:58:27.788914"]]
---
  def create
    ticket = Ticket.new
    user = User.find_by(username: params[:user])
    ticket.submitter = user
    ticket.title = params[:title]
    ticket.description = params[:description]
    ticket.assigned = get_eligible_support_member_if_available(ticket)
    ticket.open!
    ticket.save!
    if ticket.assigned
      user = ticket.assigned
      user.current_ticket = ticket
      user.save!

SELECT  "tickets".* FROM "tickets"  WHERE "tickets"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "tickets" SET "assigned_id" = ?, "updated_at" = ? WHERE "tickets"."id" = 2  [["assigned_id", 2], ["updated_at", "2015-01-04 04:58:27.873990"]]
UPDATE "users" SET "current_ticket_id" = ?, "updated_at" = ? WHERE "users"."id" = 2  [["current_ticket_id", nil], ["updated_at", "2015-01-04 04:58:27.854905"]]
---
  def update
    ticket = Ticket.find(params[:id])
    ticket.status = params[:status]
    ticket.save!

    if ticket.closed?
      assigned_user = ticket.assigned
      next_ticket = get_next_ticket(assigned_user)
      assigned_user.current_ticket = next_ticket
      assigned_user.save!